app/views/lists/edit.html.erb

  Cocktails:<br>
  <% @list.cocktails.each do |c| %>
---
SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktails_lists" ON "cocktails"."id" = "cocktails_lists"."cocktail_id" WHERE "cocktails_lists"."list_id" = $1  [["list_id", 52]]