app/views/lists/show.html.erb

<ul>
<% @list.cocktails.each do |c| %>
---
SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktails_lists" ON "cocktails"."id" = "cocktails_lists"."cocktail_id" WHERE "cocktails_lists"."list_id" = $1  [["list_id", 45]]


<% if @current_user.present? && @list.user == @current_user %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]