app/views/cocktails/_form.html.erb

  <% @ingredients.each do |i| %>
  <%= check_box_tag "ingredients[]",i.id, @cocktail.id.present? && @cocktail.ingredients.ids.include?(i.id), id: i.id %>
---
SELECT "ingredients".* FROM "ingredients"

<%= f.label :bar_id, "Bar" %>
<%= f.select :bar_id, Bar.pluck(:name, :id), include_blank: true %>
---
SELECT "bars"."name", "bars"."id" FROM "bars"