app/views/cocktails/edit.html.erb

SELECT "bars"."name", "bars"."id" FROM "bars"
---
<%= f.label :bar_id, "Bar" %>
<%= f.select :bar_id, Bar.pluck(:name, :id), include_blank: true %>