app/views/cocktails/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "cocktails_ingredients" ON "ingredients"."id" = "cocktails_ingredients"."ingredient_id" WHERE "cocktails_ingredients"."cocktail_id" = $1  [["cocktail_id", 473]]
---
<ul>
<% @cocktail.ingredients.each do |i| %>

SELECT "lists"."name", "lists"."id" FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 42]]
---
<%= label_tag :list_id, 'My lists' %>
<%= select_tag :list_id, options_for_select(@current_user.lists.pluck(:name, :id)), include_blank: true %>