app/views/bars/menu.html.erb

SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."bar_id" = $1  [["bar_id", 190]]
---
<ul>
<% @bar.cocktails.each do |cocktail| %>

SELECT "lists"."name" FROM "lists"
---
    <%= f.label :id, 'My lists' %>
    <%= f.select :id, @current_user.lists.pluck(:name), include_blank: true %>