app/views/bars/show.html.erb


  <% if @current_user.bars.include? @bar %>
---
SELECT  1 AS one FROM "bars" INNER JOIN "bars_users" ON "bars"."id" = "bars_users"."bar_id" WHERE "bars_users"."user_id" = $1 AND "bars"."id" = $2 LIMIT $3  [["user_id", 33], ["id", 190], ["LIMIT", 1]]

<ul>
<% @bar.cocktails.each do |cocktail| %>
---
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."bar_id" = $1  [["bar_id", 190]]

<ul>
  <% @bar.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."bar_id" = $1  [["bar_id", 210]]