app/views/users/show.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 28]]
---

<% @user.lists.each do |l| %>

SELECT "bars".* FROM "bars" INNER JOIN "bars_users" ON "bars"."id" = "bars_users"."bar_id" WHERE "bars_users"."user_id" = $1  [["user_id", 33]]
---

<% @user.bars.each do |b| %>