app/controllers/bars_controller.rb

  def comment
    comment = Comment.new
    comment.user_id = @current_user.id
    comment.content = params[:content]
    comment.bar_id = params[:id]
    comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "bar_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "awesome bar"], ["created_at", "2018-05-22 12:56:52.024838"], ["updated_at", "2018-05-22 12:56:52.024838"], ["bar_id", 210], ["user_id", 42]]

  def unfavourite
    # this will only work if you're logged in
    # User.first.bars.include? Bar.first
    bar = Bar.find params[:id]
    @current_user.bars.delete( bar )
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 190], ["LIMIT", 1]]
DELETE FROM "bars_users" WHERE "bars_users"."bar_id" = $1  [["bar_id", 193]]

  def show
    @comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."bar_id" = $1  [["bar_id", 207]]

  def update
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @bar.image = req["public_id"]
    end

    @bar.update bar_params
---
UPDATE "bars" SET "image" = $1, "updated_at" = $2 WHERE "bars"."id" = $3  [["image", "kjsrtgo2woobubws8qn5"], ["updated_at", "2018-05-22 05:58:51.952775"], ["id", 203]]

  def get_bar
    @bar = Bar.find params[:id]
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 210], ["LIMIT", 1]]