app/controllers/bars_controller.rb

  def create
    bar = Bar.new bar_params
    bar.save
---
INSERT INTO "bars" ("name", "image", "description", "phone", "website", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def favourite
    # this will only work if you're logged in
    bar = Bar.find params[:id]
    unless @current_user.bars.include? bar
      # not already a favourite bar
      @current_user.bars << bar
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 189], ["LIMIT", 1]]
SELECT  1 AS one FROM "bars" INNER JOIN "bars_users" ON "bars"."id" = "bars_users"."bar_id" WHERE "bars_users"."user_id" = $1 AND "bars"."id" = $2 LIMIT $3  [["user_id", 33], ["id", 189], ["LIMIT", 1]]
INSERT INTO "bars_users" ("user_id", "bar_id") VALUES ($1, $2)  [["user_id", 33], ["bar_id", 189]]

  def unfavourite
    # this will only work if you're logged in
    # User.first.bars.include? Bar.first
    bar = Bar.find params[:id]
    @current_user.bars.delete( bar )
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 187], ["LIMIT", 1]]
DELETE FROM "bars_users" WHERE "bars_users"."user_id" = $1 AND "bars_users"."bar_id" = $2  [["user_id", 33], ["bar_id", 189]]

  def menu
    # @lists = @current_user.lists
    @bar = Bar.find params[:id]
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 192], ["LIMIT", 1]]

  def index
    @bars = Bar.all
---
SELECT "bars".* FROM "bars"

  def update
    @bar.update bar_params
---
UPDATE "bars" SET "image" = $1, "website" = $2, "updated_at" = $3 WHERE "bars"."id" = $4  [["image", "http://eatdrinkplay.com/wp-content/uploads/2013/09/the-barbershop.jpg"], ["website", "http://thisisthebarbershop.com/"], ["updated_at", "2018-05-21 13:58:02.753458"], ["id", 192]]

  def destroy
    @bar.destroy
---
DELETE FROM "bars" WHERE "bars"."id" = $1  [["id", 193]]

  def get_bar
    @bar = Bar.find params[:id]
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 191], ["LIMIT", 1]]