app/controllers/cocktails_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 484], ["LIMIT", 1]]
UPDATE "cocktails" SET "name" = $1, "image" = $2, "updated_at" = $3 WHERE "cocktails"."id" = $4  [["name", "Long Island Iced Tea2"], ["image", ""], ["updated_at", "2018-05-21 05:09:05.110351"], ["id", 473]]
---
  def create
    cocktail = Cocktail.create cocktail_params

    if cocktail.persisted?
      if params[:file].present?
        req = Cloudinary::Uploader.upload(params[:file])
        cocktail.image = req["public_id"]
      end
      cocktail.ingredients << Ingredient.find( params[:ingredients] )
      cocktail.save