app/controllers/cocktails_controller.rb

  def new
    @cocktail = Cocktail.new
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @cocktail.image = req["public_id"]
    end
    @cocktail.bar_id = params[:id]
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def create
    cocktail = Cocktail.new cocktail_params
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      cocktail.image = req["public_id"]
    end
    cocktail.save
---
INSERT INTO "cocktails" ("name", "description", "bar_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test cocktail"], ["description", "new cocktail"], ["bar_id", 210], ["created_at", "2018-05-22 12:35:20.422989"], ["updated_at", "2018-05-22 12:35:20.422989"]]

  def show
    @lists = @cocktail.lists.where(user_id: @current_user)
---
SELECT "lists".* FROM "lists" INNER JOIN "cocktails_lists" ON "lists"."id" = "cocktails_lists"."list_id" WHERE "cocktails_lists"."cocktail_id" = $1 AND "lists"."user_id" = $2  [["cocktail_id", 505], ["user_id", 39]]

  def favourite
    list = List.find params[:list_id]
    unless list.user == @current_user
      # ensure list belongs to current user, i.e. prevent list ID hackers!
      redirect_to cocktails_path and return
    end
    cocktail = Cocktail.find params[:id]
    if list.cocktails.include? cocktail
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 522], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 483], ["LIMIT", 1]]
SELECT  1 AS one FROM "cocktails" INNER JOIN "cocktails_lists" ON "cocktails"."id" = "cocktails_lists"."cocktail_id" WHERE "cocktails_lists"."list_id" = $1 AND "cocktails"."id" = $2 LIMIT $3  [["list_id", 56], ["id", 522], ["LIMIT", 1]]

  def unfavourite
    list = List.find params[:list_id]
    unless list.user == @current_user
      redirect_to cocktail_path and return
    end
    cocktail = Cocktail.find params[:id]
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 477], ["LIMIT", 1]]

  def edit
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def update
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @cocktail.image = req["public_id"]
    end
    @cocktail.update cocktail_params
---
UPDATE "cocktails" SET "image" = $1, "updated_at" = $2 WHERE "cocktails"."id" = $3  [["image", "mur47uo6onqlyy22lw1j"], ["updated_at", "2018-05-22 13:08:02.283589"], ["id", 522]]

  def destroy
    @cocktail.destroy
---
DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 538]]

  def get_cocktail
    @cocktail = Cocktail.find params[:id]
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 538], ["LIMIT", 1]]