app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "note", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "R-N-C"], ["note", "test"], ["created_at", "2018-05-21 12:34:26.801991"], ["updated_at", "2018-05-21 12:34:26.801991"], ["user_id", 33]]
---
  def create
    list = List.new list_params
    list.user = @current_user
    list.save

UPDATE "lists" SET "note" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["note", ""], ["updated_at", "2018-05-22 07:34:09.011530"], ["id", 56]]
SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktails_lists" ON "cocktails"."id" = "cocktails_lists"."cocktail_id" WHERE "cocktails_lists"."list_id" = $1  [["list_id", 56]]
---
  def update
    # raise 'hell'
    @list.update list_params

    # make changes to cocktails list (array of IDs in params[:cocktails] provided by form checkboxes)
    @list.cocktails.destroy_all
    @list.cocktails << Cocktail.find( params[:cocktails] )

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
  def get_list
    @list = List.find params[:id]