app/controllers/session_controller.rb

  def create
    user = User.find_by email: params[:email]
    # raise "hell"
    if user.present? && user.authenticate( params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "grant@ga.co"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (grant@ga.co) LIMIT $1  [["LIMIT", 1]]