app/controllers/users_controller.rb

  def create
    user = User.create user_params
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    cocktail = Cocktail.find params[:id]
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]